tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"

# Brew CLI apps
brew "python"
brew "awscli"
brew "circleci"
brew "docker"
brew "jq"
brew "node"
brew "parallel"
brew "postgresql@12"
brew "redis"
brew "rmtrash"
brew "terraform"
cask "trash"
brew "romkatv/powerlevel10k/powerlevel10k"

# App casks
cask "1password"
cask "alfred"
cask "bartender"
cask "docker"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "image2icon"
cask "iterm2"
cask "menumeters"
cask "notion"
cask "postman"
cask "slack"
cask "spotify"
cask "ticktick"
cask "the-unarchiver"
cask "visual-studio-code"
cask "zoom"

# Font casks
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"

# Mac App Store apps
mas "Meeter", id: 1510445899
mas "Xcode", id: 497799835
mas "Magnet", id: 441258766
mas "MainStage", id: 634159523
mas "Keynote", id: 409183694
mas "iMovie", id: 408981434
mas "Things", id: 904280696
mas "Bear", id: 1091189122
mas "Pages", id: 409201541
mas "Logic Pro", id: 634148309
mas "Numbers", id: 409203825
mas "Speedtest", id: 1153157709
mas "EpocCamViewer", id: 736008948

# Manual Apps (for documentation)
# hx edit
# muteme-client